# Tutustutaan pandas-kirjaston tietorakenteisiin

In [6]:
import pandas as pd

## Series

Luodaan ensin lista

In [10]:
lista = ['eka','toka','kolmas']

Muutetaan lista Series-objektiksi:

In [128]:
sarja = pd.Series(lista)

In [9]:
sarja

0       eka
1      toka
2    kolmas
dtype: object

Sarjan alkioihin voi viitata indeksin avulla:

In [13]:
sarja[1]

'toka'

Annetaan Series-objekti vielä otsikko:

In [16]:
sarja.name = 'otsikko'

In [17]:
sarja

0       eka
1      toka
2    kolmas
Name: otsikko, dtype: object

## Dataframe

### Luodaan taulukko yhdistämällä Series-objekteja

Käytetään nyt Series-objekteja dataframe-objektin luomiseen. Dataframe on tietorakenne, johon voi säilöä taulukkomuodossa dataa.

Luodaan ensin kolme muuttujaa Series-objekteina:

In [22]:
nimi = pd.Series(['Matti','Pekka','Liisa','Anne'])
nimi.name = 'nimi'

In [24]:
ika = pd.Series([45,32,63,27])
ika.name = 'ikä'

In [25]:
ammatti = pd.Series(['lääkäri','kirjastovirkailija','veturinkuljettaja','opettaja'])
ammatti.name = 'ammatti'

Series-objekteja voi yhdistellä concat-funktiolla kahdella tavalla. Katsotaan, mikä merkitystä axis-ominaisuudella on:

In [131]:
taulukkoEiJarkeva = pd.concat([nimi,ika,ammatti],axis=0)

In [132]:
taulukkoEiJarkeva

0                 Matti
1                 Pekka
2                 Liisa
3                  Anne
0                    45
1                    32
2                    63
3                    27
0               lääkäri
1    kirjastovirkailija
2     veturinkuljettaja
3              opettaja
dtype: object

Tämä ei se, mitä halusimme. Tässä objektit yhdistettiin peräkkäin. Haluamme ne vierekkäin. Pythonissa axis-ominaisuus kertoo tämän suunnan, niin että nolla viittaa tässä mielessä vertikaaliseen yhdistämiseen, kun taas yksi viittaa horisontaaliseen yhdistämiseen. Kokeillaan siis vaihtoehtoa yksi:

In [133]:
taulukko1 = pd.concat([nimi,ika,ammatti],axis=1)

In [134]:
taulukko1

    nimi  ikä             ammatti
0  Matti   45             lääkäri
1  Pekka   32  kirjastovirkailija
2  Liisa   63   veturinkuljettaja
3   Anne   27            opettaja

### Luodaan taulukko suoraan

Dataframe-taulukon voi rakentaa suoraankin ilman, että ensin rakentaa kunkin muuttujan erikseen. Kokeillaan tätä seuraavaksi. (Tässä käytetään välivaiheena dictionary-rakennetta.)

In [135]:
tiedot = {'nimi': ['Claude Shannon', 'Johann Sebastian Bach', 'Carl Friedrich Gauss','Matti'],
          'ikä': [107,338,246,45],
          'mieliruoka': ['lihapullat', 'makkara', 'perunalaatikko', 'porkkanaraaste']}

In [136]:
taulukko2 = pd.DataFrame(tiedot)

In [137]:
taulukko2

                    nimi  ikä      mieliruoka
0         Claude Shannon  107      lihapullat
1  Johann Sebastian Bach  338         makkara
2   Carl Friedrich Gauss  246  perunalaatikko
3                  Matti   45  porkkanaraaste

### Taulukkojen yhdistäminen vierekkäin ja peräkkäin

Yhdistetään taulukko1 ja taulukko2. Ne olivat siis tällaiset:

In [140]:
taulukko1

    nimi  ikä             ammatti
0  Matti   45             lääkäri
1  Pekka   32  kirjastovirkailija
2  Liisa   63   veturinkuljettaja
3   Anne   27            opettaja

In [141]:
taulukko2

                    nimi  ikä      mieliruoka
0         Claude Shannon  107      lihapullat
1  Johann Sebastian Bach  338         makkara
2   Carl Friedrich Gauss  246  perunalaatikko
3                  Matti   45  porkkanaraaste

In [142]:
taulukko3 = pd.concat([taulukko1,taulukko2],ignore_index=True,keys=['nimi','nimi'])

In [143]:
taulukko3

                    nimi  ikä             ammatti      mieliruoka
0                  Matti   45             lääkäri             NaN
1                  Pekka   32  kirjastovirkailija             NaN
2                  Liisa   63   veturinkuljettaja             NaN
3                   Anne   27            opettaja             NaN
4         Claude Shannon  107                 NaN      lihapullat
5  Johann Sebastian Bach  338                 NaN         makkara
6   Carl Friedrich Gauss  246                 NaN  perunalaatikko
7                  Matti   45                 NaN  porkkanaraaste

Edellä argumentin ignore_index arvoksi laitetiin True, jotta indeksointi pysyy järkevänä.

Huomaa, että Matti kuitenkin esiintyy nyt kaksi kertaa, koska ne tulkitaan eri henkilöiksi, joilla vain on sama nimi ja ikä. Yhdistetään taulukot niin, että molemmissa olevat muuttujat nimi ja ikä tulkitaan samoiksi:

In [126]:
taulukko4 = taulukko1.merge(taulukko2,on=['nimi','ikä'],how='outer')

In [144]:
taulukko4

                    nimi  ikä             ammatti      mieliruoka
0                  Matti   45             lääkäri  porkkanaraaste
1                  Pekka   32  kirjastovirkailija             NaN
2                  Liisa   63   veturinkuljettaja             NaN
3                   Anne   27            opettaja             NaN
4         Claude Shannon  107                 NaN      lihapullat
5  Johann Sebastian Bach  338                 NaN         makkara
6   Carl Friedrich Gauss  246                 NaN  perunalaatikko